[
  {
    "title": "ACCC grants interim authorisation to allow Battery Stewardship Scheme to continue with limited levy and rebate adjustments",
    "url": "https://www.accc.gov.au/media-release/accc-grants-interim-authorisation-to-allow-battery-stewardship-scheme-to-continue-with-limited-levy-and-rebate-adjustments",
    "summary": "The ACCC has granted interim authorisation with a condition to the Battery Stewardship Council (BSC) to continue operating the Battery Stewardship Scheme with a limited adjustment of the Scheme’s levy and rebates.",
    "date": "04 Jun 2025"
  },
  {
    "title": "Clorox ordered to pay $8.25m in penalties for misleading 'ocean plastic' claims about certain GLAD products",
    "url": "https://www.accc.gov.au/media-release/clorox-ordered-to-pay-825m-in-penalties-for-misleading-ocean-plastic-claims-about-certain-glad-products",
    "summary": "The Federal Court today ordered Clorox Australia Pty Ltd (Clorox) to pay a total penalty of $8.25 million for making false or misleading representations to consumers that certain GLAD kitchen and garbage bags were partly made of recycled ‘ocean plastic’, following court action by the ACCC.",
    "date": "14 Apr 2025"
  },
  {
    "title": "Retail pricing, merger reform implementation and competition issues among ACCC's 2025-26 priorities",
    "url": "https://www.accc.gov.au/media-release/retail-pricing-merger-reform-implementation-and-competition-issues-among-acccs-2025-26-priorities",
    "summary": "Retail pricing, merger reform implementation and competition issues among ACCC’s 2025-26 priorities",
    "date": "20 Feb 2025"
  },
  {
    "title": "ACCC releases final guide on sustainability collaborations",
    "url": "https://www.accc.gov.au/media-release/accc-releases-final-guide-on-sustainability-collaborations",
    "summary": "The ACCC has today released its final guide on sustainability collaborations and Australian competition law.",
    "date": "18 Dec 2024"
  },
  {
    "title": "ACCC proposes to authorise flooring recycling scheme",
    "url": "https://www.accc.gov.au/media-release/accc-proposes-to-authorise-flooring-recycling-scheme",
    "summary": "The ACCC is proposing to grant authorisation for ResiLoop to establish and operate a voluntary, industry-led product stewardship scheme (the Scheme) that collects and recycles resilient flooring waste.",
    "date": "16 Aug 2024"
  },
  {
    "title": "ACCC consulting on guide to sustainability collaborations",
    "url": "https://www.accc.gov.au/media-release/accc-consulting-on-guide-to-sustainability-collaborations",
    "summary": "The ACCC has today published a draft guide on sustainability collaborations and Australian competition law.",
    "date": "08 Jul 2024"
  },
  {
    "title": "Rain kept water availability high across the Murray-Darling Basin",
    "url": "https://www.accc.gov.au/media-release/rain-kept-water-availability-high-across-the-murray-darling-basin",
    "summary": "Wet conditions across the Murray-Darling Basin in 2022-23 kept water availability high, while regulated water charges varied substantially, reflecting the different tariff structures and approaches to cost recovery taken by each Basin State, the ACCC’s annual water monitoring report shows.",
    "date": "02 Jul 2024"
  },
  {
    "title": "Emerging technology risks among ACCC product safety priorities",
    "url": "https://www.accc.gov.au/media-release/emerging-technology-risks-among-accc-product-safety-priorities",
    "summary": "Risks associated with the use of emerging technology in consumer products such as lithium-ion battery powered products and virtual reality products will be a key focus of the ACCC’s product safety priorities",
    "date": "27 Jun 2024"
  },
  {
    "title": "ACCC proposes to reauthorise Tyre Product Stewardship Scheme",
    "url": "https://www.accc.gov.au/media-release/accc-proposes-to-reauthorise-tyre-product-stewardship-scheme",
    "summary": "The ACCC is proposing to grant authorisation for the Tyre Product Stewardship scheme to continue for a further 3 years.",
    "date": "07 Jun 2024"
  },
  {
    "title": "GLAD bags manufacturer in court for '50% ocean plastic' claims",
    "url": "https://www.accc.gov.au/media-release/glad-bags-manufacturer-in-court-for-50-ocean-plastic-claims",
    "summary": "The ACCC has instituted proceedings in the Federal Court against Clorox Australia Pty Ltd, the manufacturer of GLAD-branded kitchen and garbage bags, for allegedly making false or misleading representations that certain kitchen and garbage bags were partly made of recycled ‘ocean plastic’, in breach of the Australian Consumer Law.",
    "date": "18 Apr 2024"
  }
]